In [3]:
import pandas as pd
import numpy as np

In [199]:
data = pd.Series([1,2,3,4,5], index =["a","b","c","d","e"])
data

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [9]:
data.name = "Numbers"

In [10]:
data.size

5

In [11]:
data

a    1
b    2
c    3
d    4
e    5
Name: Numbers, dtype: int64

In [12]:
data.shape

(5,)

In [13]:
data.values

array([1, 2, 3, 4, 5])

In [201]:
data["a"], data["d"]

(np.int64(1), np.int64(4))

In [18]:
data.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [28]:
data.loc[["a","e","c"]], data.iloc[3]

(a    1
 e    5
 c    3
 Name: Numbers, dtype: int64,
 np.int64(4))

In [29]:
##dataframes:

In [205]:
dict = {
    "usn": [1,2,3,4],
    "name": ["zms", "fwz", "arsh", "naz"],
    "age" : [20,21,23,21]
}
dict

{'usn': [1, 2, 3, 4],
 'name': ['zms', 'fwz', 'arsh', 'naz'],
 'age': [20, 21, 23, 21]}

In [36]:
df = pd.DataFrame(dict)
df

   usn  name  age
0    1   zms   20
1    2   fwz   21
2    3  arsh   23
3    4   naz   21

In [38]:
data = pd.read_csv(r"C:\Users\Personal\OneDrive\Desktop\sample.csv")
data.head(10)

,Unnamed: 0,EmpID,Name,Department,Age,Salary,Experience,JoiningDate,City,PerformanceScore
0,0,101,Ram,IT,25,50000,2,2021-01-15,Bangalore,4.5
1,1,102,Shyam,HR,30,45000,5,2019-03-10,Mumbai,3.8
2,2,103,Geeta,Finance,28,60000,4,2020-07-22,Delhi,4.2
3,3,104,Anita,IT,35,75000,10,2015-09-30,Bangalore,4.9
4,4,105,Kiran,HR,32,52000,7,2018-06-12,Mumbai,4.1
5,5,106,John,Finance,29,58000,3,2021-11-05,Delhi,3.9
6,6,107,Meena,IT,41,82000,15,2010-04-18,Bangalore,4.8
7,7,108,David,HR,26,48000,2,2022-02-14,Mumbai,3.7
8,8,109,Sara,Finance,38,61000,12,2013-12-01,Delhi,4.3
9,9,110,Arjun,IT,27,54000,4,2020-08-19,Bangalore,4.0

In [39]:
data.tail(6)

,Unnamed: 0,EmpID,Name,Department,Age,Salary,Experience,JoiningDate,City,PerformanceScore
14,14,115,Vijay,Finance,36,62000,11,2014-01-10,Delhi,4.2
15,15,116,Neha,IT,40,88000,14,2011-10-21,Bangalore,4.7
16,16,117,Amit,HR,34,53000,8,2016-04-05,Mumbai,4.0
17,17,118,Pooja,Finance,30,57000,6,2018-12-12,Delhi,4.1
18,18,119,Rahul,IT,28,56000,4,2020-02-28,Bangalore,3.9
19,19,120,Divya,HR,37,49500,9,2015-06-30,Mumbai,4.3

In [40]:
data.describe()

,Unnamed: 0,EmpID,Age,Salary,Experience,PerformanceScore
count,20.00000,20.00000,20.000000,20.000000,20.000000,20.000000
mean,9.50000,110.50000,32.700000,59875.000000,7.400000,4.190000
std,5.91608,5.91608,5.449288,13388.796377,4.615762,0.415363
min,0.00000,101.00000,25.000000,45000.000000,2.000000,3.500000
25%,4.75000,105.75000,28.750000,50750.000000,4.000000,3.900000
50%,9.50000,110.50000,31.500000,56500.000000,6.000000,4.150000
75%,14.25000,115.25000,36.250000,61250.000000,10.250000,4.425000
max,19.00000,120.00000,45.000000,90000.000000,18.000000,4.900000

In [41]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Unnamed: 0        20 non-null     int64
 1   EmpID             20 non-null     int64
 2   Name              20 non-null     object
 3   Department        20 non-null     object
 4   Age               20 non-null     int64
 5   Salary            20 non-null     int64
 6   Experience        20 non-null     int64
 7   JoiningDate       20 non-null     object
 8   City              20 non-null     object
 9   PerformanceScore  20 non-null     float64
dtypes: float64(1), int64(5), object(4)
memory usage: 1.7+ KB

In [42]:
data.shape

(20, 10)

In [43]:
data.sample()

,Unnamed: 0,EmpID,Name,Department,Age,Salary,Experience,JoiningDate,City,PerformanceScore
19,19,120,Divya,HR,37,49500,9,2015-06-30,Mumbai,4.3

In [46]:
data[["Name", "Age", "City"]]

     Name  Age       City
0     Ram   25  Bangalore
1   Shyam   30     Mumbai
2   Geeta   28      Delhi
3   Anita   35  Bangalore
4   Kiran   32     Mumbai
5    John   29      Delhi
6   Meena   41  Bangalore
7   David   26     Mumbai
8    Sara   38      Delhi
9   Arjun   27  Bangalore
10   Ravi   33     Mumbai
11  Priya   31      Delhi
12  Kunal   45  Bangalore
13  Sneha   29     Mumbai
14  Vijay   36      Delhi
15   Neha   40  Bangalore
16   Amit   34     Mumbai
17  Pooja   30      Delhi
18  Rahul   28  Bangalore
19  Divya   37     Mumbai

In [219]:
test2 = pd.read_csv(r"C:\Users\Personal\OneDrive\Desktop\test2.csv")
test2

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David   NaN         IT  62000.0
4           4      Eve  29.0         HR      NaN
5           5    Alice  25.0         HR  50000.0

In [220]:
test2.isnull()

   Unnamed: 0   Name    Age  Department  Salary
0       False  False  False       False   False
1       False  False  False       False   False
2       False  False  False       False   False
3       False  False   True       False   False
4       False  False  False       False    True
5       False  False  False       False   False

In [221]:
test2.iloc[1:4,1:4]

      Name   Age Department
1      Bob  30.0         IT
2  Charlie  35.0    Finance
3    David   NaN         IT

In [222]:
test2.rename(columns= {"Name":"N", "Age":"A", "Department":"Dept", "Salary":"Sal"})
test2

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David   NaN         IT  62000.0
4           4      Eve  29.0         HR      NaN
5           5    Alice  25.0         HR  50000.0

In [135]:
test2.drop("Unnamed: 0", axis=1,inplace=True)
test2

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

In [136]:
test2

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

In [137]:
test2["Updated_Salary"]=test2["Salary"]+ 5000

In [138]:
test2

      Name   Age Department   Salary  Updated_Salary
0    Alice  25.0         HR  50000.0         55000.0
1      Bob  30.0         IT  60000.0         65000.0
2  Charlie  35.0    Finance  70000.0         75000.0
3    David   NaN         IT  62000.0         67000.0
4      Eve  29.0         HR      NaN             NaN
5    Alice  25.0         HR  50000.0         55000.0

In [139]:
test2["Updated_Salary2"]=test2["Salary"].map(lambda x:x+10000)

In [140]:
test2

      Name   Age Department   Salary  Updated_Salary  Updated_Salary2
0    Alice  25.0         HR  50000.0         55000.0          60000.0
1      Bob  30.0         IT  60000.0         65000.0          70000.0
2  Charlie  35.0    Finance  70000.0         75000.0          80000.0
3    David   NaN         IT  62000.0         67000.0          72000.0
4      Eve  29.0         HR      NaN             NaN              NaN
5    Alice  25.0         HR  50000.0         55000.0          60000.0

In [141]:
test2["branch"]= ["ab","bc","cd","ef","gf","yt"]

In [142]:
test2

      Name   Age Department   Salary  Updated_Salary  Updated_Salary2 branch
0    Alice  25.0         HR  50000.0         55000.0          60000.0     ab
1      Bob  30.0         IT  60000.0         65000.0          70000.0     bc
2  Charlie  35.0    Finance  70000.0         75000.0          80000.0     cd
3    David   NaN         IT  62000.0         67000.0          72000.0     ef
4      Eve  29.0         HR      NaN             NaN              NaN     gf
5    Alice  25.0         HR  50000.0         55000.0          60000.0     yt

In [143]:
test2.drop("branch", axis=1, inplace=True)

In [162]:
test2

      Name  Age Department   Salary  Updated_Salary  Updated_Salary2
0    Alice   25         HR  50000.0         55000.0          60000.0
1      Bob   30         IT  60000.0         65000.0          70000.0
2  Charlie   35    Finance  70000.0         75000.0          80000.0
5    Alice   25         HR  50000.0         55000.0          60000.0

In [228]:

test2

   Unnamed: 0     Name   Age Department   Salary  new age
0           0    Alice  25.0         HR  50000.0     30.0
1           1      Bob  30.0         IT  60000.0     35.0
2           2  Charlie  35.0    Finance  70000.0     40.0
3           3    David   NaN         IT  62000.0      NaN
4           4      Eve  29.0         HR      NaN     34.0
5           5    Alice  25.0         HR  50000.0     30.0

In [166]:
test2.isnull()

    Name    Age  Department  Salary  Updated_Salary  Updated_Salary2
0  False  False       False   False           False            False
1  False  False       False   False           False            False
2  False  False       False   False           False            False
5  False  False       False   False           False            False

In [167]:
test2

      Name  Age Department   Salary  Updated_Salary  Updated_Salary2
0    Alice   25         HR  50000.0         55000.0          60000.0
1      Bob   30         IT  60000.0         65000.0          70000.0
2  Charlie   35    Finance  70000.0         75000.0          80000.0
5    Alice   25         HR  50000.0         55000.0          60000.0

In [168]:
test2.isnull().sum()

Name               0
Age                0
Department         0
Salary             0
Updated_Salary     0
Updated_Salary2    0
dtype: int64

In [169]:
test3= pd.read_csv(r"C:\Users\Personal\OneDrive\Desktop\test2.csv")
test3

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David   NaN         IT  62000.0
4           4      Eve  29.0         HR      NaN
5           5    Alice  25.0         HR  50000.0

In [170]:
test3.isnull().sum()

Unnamed: 0    0
Name          0
Age           1
Department    0
Salary        1
dtype: int64

In [172]:
test3["Age"]= test3["Age"].fillna(value=test3["Age"].mean())
test3["Salary"]=test3["Salary"].fillna(value=test3["Salary"].mean())
test3

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David  28.8         IT  62000.0
4           4      Eve  29.0         HR  58400.0
5           5    Alice  25.0         HR  50000.0

In [174]:
test3["Department"].value_counts()

Department
HR         3
IT         2
Finance    1
Name: count, dtype: int64

In [175]:
test3

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David  28.8         IT  62000.0
4           4      Eve  29.0         HR  58400.0
5           5    Alice  25.0         HR  50000.0

In [178]:
test3["Level"] = test3.apply(lambda row: "High" if row["Salary"] >= 60000 else "Low", axis=1)

In [179]:
test3

   Unnamed: 0     Name   Age Department   Salary Level
0           0    Alice  25.0         HR  50000.0   Low
1           1      Bob  30.0         IT  60000.0  High
2           2  Charlie  35.0    Finance  70000.0  High
3           3    David  28.8         IT  62000.0  High
4           4      Eve  29.0         HR  58400.0   Low
5           5    Alice  25.0         HR  50000.0   Low

In [236]:
test3.groupby("Department")["Salary"].mean()

Department
Finance    70000.0
HR         52800.0
IT         61000.0
Name: Salary, dtype: float64

In [196]:
test3.groupby(["Level"]).size()

Level
High    3
Low     3
dtype: int64

In [246]:
test3.groupby(["Age"]).size()

Age
25.0    2
28.8    1
29.0    1
30.0    1
35.0    1
dtype: int64